УчетВУправляющихДляГит1/src/InformationRegisters/СведенияОбАлкогольнойПродукции/СведенияОбАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбАлкогольнойПродукции</name>
  <resources>
    <name>УдалитьВидПродукции</name>
    <type>
      <types>CatalogRef.УдалитьВидыАлкогольнойПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВидЛицензии</name>
    <type>
      <types>EnumRef.ВидыЛицензийНаПродажуАлкоголя</types>
    </type>
  </resources>
  <resources>
    <name>КоэффПересчетаДал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодВида129</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеВида129</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодВида169</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеВида169</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СведенияОбАлкогольнойПродукции/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрыСведений.СведенияОбАлкогольнойПродукции.СписокВидовПродукции(Элементы.КодВида169.СписокВыбора);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодВида169ПриИзменении(Элемент)
	                     
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(Запись.КодВида169);
	Если ЭлементСписка <> Неопределено Тогда
		Запись.НаименованиеВида169 = СтрЗаменить(ЭлементСписка.Представление, Запись.КодВида169 + " - ", "");
	Иначе
		Запись.НаименованиеВида169 = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
